<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-12-09T18:42:24.717569827"><title>Desenvolvimento | Flash Pomo - Home</title><script type="application/json" id="virtual-toc-data">[{"id":"projeto","level":0,"title":"Projeto","anchor":"#projeto"},{"id":"mercado","level":0,"title":"Mercado","anchor":"#mercado"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b518/app.css" rel="stylesheet"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="Desenvolvimento | Flash Pomo - Home"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Flash Pomo - Home Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation/desenvolvimento.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="Desenvolvimento | Flash Pomo - Home"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation/desenvolvimento.html#webpage",
    "url": "writerside-documentation/desenvolvimento.html",
    "name": "Desenvolvimento | Flash Pomo - Home",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Flash Pomo - Home Help"
}</script><!-- End Schema.org --></head><body data-id="Desenvolvimento" data-main-title="Desenvolvimento" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs=""><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Flash Pomo - Home  Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="Desenvolvimento" id="Desenvolvimento.md">Desenvolvimento</h1><section class="chapter"><h2 id="projeto" data-toc="projeto">Projeto</h2><p id="jcy05a_5">Este projeto visa desenvolver um aplicativo voltado para o meio acad&ecirc;mico, combinando as estrat&eacute;gias de estudo Pomodoro e Flashcards em uma &uacute;nica plataforma. O objetivo &eacute; criar uma solu&ccedil;&atilde;o completa que permita aos usu&aacute;rios gerenciar seu tempo de estudo de forma eficiente e organizar seus materiais de aprendizado de maneira efetiva.</p><p id="jcy05a_6">Uma das principais funcionalidades do aplicativo ser&aacute; a integra&ccedil;&atilde;o da t&eacute;cnica Pomodoro. Essa t&eacute;cnica de gerenciamento de tempo ajudar&aacute; os usu&aacute;rios a manterem sua concentra&ccedil;&atilde;o e produtividade durante os momentos de estudo. Al&eacute;m disso, o aplicativo contar&aacute; com ferramentas de cria&ccedil;&atilde;o e edi&ccedil;&atilde;o de flashcards, uma estrat&eacute;gia amplamente utilizada por estudantes para memoriza&ccedil;&atilde;o e revis&atilde;o de conte&uacute;do.</p><p id="jcy05a_7">Outra funcionalidade chave ser&aacute; o mercado interno, onde os usu&aacute;rios poder&atilde;o negociar seus flashcards usando uma moeda pr&oacute;pria da plataforma. Essa integra&ccedil;&atilde;o de um ambiente de compra e venda de material de estudo criar&aacute; um ecossistema din&acirc;mico de aprendizado, incentivando a troca de conhecimento e a colabora&ccedil;&atilde;o entre os usu&aacute;rios.</p><p id="jcy05a_8">Ao combinar estrat&eacute;gias de estudo comprovadas, gerenciamento de tempo e um mercado interno, o aplicativo se posicionar&aacute; como uma solu&ccedil;&atilde;o inovadora e completa para as necessidades do meio acad&ecirc;mico. Espera-se que essa integra&ccedil;&atilde;o de ferramentas melhore o desempenho e o engajamento dos estudantes, al&eacute;m de fomentar a colabora&ccedil;&atilde;o e o compartilhamento de conhecimento entre os usu&aacute;rios.</p><p id="jcy05a_9">O desenvolvimento deste aplicativo visa atender &agrave;s demandas do p&uacute;blico acad&ecirc;mico, oferecendo uma plataforma que integre eficientemente as principais estrat&eacute;gias de estudo e aprendizado.</p><section class="chapter"><h3 id="objetivo-geral" data-toc="objetivo-geral">Objetivo Geral</h3><p id="jcy05a_12">O objetivo geral deste projeto &eacute; desenvolver um aplicativo que combine as estrat&eacute;gias de estudo Pomodoro e Flashcards, oferecendo aos usu&aacute;rios do meio acad&ecirc;mico uma plataforma integrada e eficiente para gerenciar seu tempo de estudo e organizar seus materiais de aprendizado.</p></section><section class="chapter"><h3 id="objetivos-espec-ficos" data-toc="objetivos-espec-ficos">Objetivos Espec&iacute;ficos</h3><ol class="list _decimal" id="jcy05a_13" type="1"><li class="list__item" id="jcy05a_15"><p id="jcy05a_21"><span class="control" id="jcy05a_22">Implementar a funcionalidade de Pomodoro</span>: integrar a t&eacute;cnica Pomodoro no aplicativo, permitindo que os usu&aacute;rios gerenciem seu tempo de estudo de forma eficiente, alternando per&iacute;odos de trabalho intenso e breves intervalos.</p></li><li class="list__item" id="jcy05a_16"><p id="jcy05a_23"><span class="control" id="jcy05a_24">Desenvolver ferramentas de cria&ccedil;&atilde;o e edi&ccedil;&atilde;o de Flashcards</span>: criar uma interface intuitiva para que os usu&aacute;rios possam criar, armazenar, editar e organizar seus flashcards de forma eficaz.</p></li><li class="list__item" id="jcy05a_17"><p id="jcy05a_25"><span class="control" id="jcy05a_26">Estabelecer um Mercado Interno de Flashcards</span>: implementar um sistema de compra e venda de flashcards entre os usu&aacute;rios, utilizando uma moeda pr&oacute;pria da aplica&ccedil;&atilde;o, a fim de fomentar a troca de conhecimento e a colabora&ccedil;&atilde;o na comunidade acad&ecirc;mica.</p></li><li class="list__item" id="jcy05a_18"><p id="jcy05a_27"><span class="control" id="jcy05a_28">Integrar as funcionalidades de Pomodoro e Flashcards</span>: garantir uma experi&ecirc;ncia fluida e integrada entre as estrat&eacute;gias de estudo Pomodoro e o uso de Flashcards, otimizando o fluxo de aprendizado dos usu&aacute;rios.</p></li><li class="list__item" id="jcy05a_19"><p id="jcy05a_29"><span class="control" id="jcy05a_30">Desenvolver uma Interface Intuitiva e Acess&iacute;vel</span>: criar uma interface de usu&aacute;rio intuitiva, responsiva e acess&iacute;vel, de modo a facilitar a ado&ccedil;&atilde;o e a usabilidade do aplicativo por parte do p&uacute;blico-alvo.</p></li><li class="list__item" id="jcy05a_20"><p id="jcy05a_31"><span class="control" id="jcy05a_32">Promover a Colabora&ccedil;&atilde;o e Compartilhamento de Conhecimento</span>: Atrav&eacute;s do Mercado Interno de Flashcards, incentivar a colabora&ccedil;&atilde;o e o compartilhamento de conhecimento entre os usu&aacute;rios do aplicativo, fomentando o aprendizado m&uacute;tuo.</p></li></ol></section></section><section class="chapter"><h2 id="mercado" data-toc="mercado">Mercado</h2><section class="chapter"><h3 id="an-lise-de-mercado" data-toc="an-lise-de-mercado">An&aacute;lise de Mercado</h3><section class="chapter"><h4 id="p-blico-alvo" data-toc="p-blico-alvo">P&uacute;blico Alvo</h4><p id="jcy05a_39">O aplicativo tem como p&uacute;blico-alvo estudantes de ensino m&eacute;dio ao n&iacute;vel universit&aacute;rio, abrangendo:</p><div class="table-wrapper"><table class="wide" id="jcy05a_40"><thead><tr class="ijRowHead" id="jcy05a_43"><th id="jcy05a_47"><p>Perfil</p></th><th id="jcy05a_48"><p>Descri&ccedil;&atilde;o</p></th></tr></thead><tbody><tr id="jcy05a_44"><td id="jcy05a_49"><p>Estudantes do Ensino M&eacute;dio</p></td><td id="jcy05a_50"><p>Alunos que buscam ferramentas para melhorar sua organiza&ccedil;&atilde;o e produtividade nos estudos, preparando-se para o ambiente universit&aacute;rio.</p></td></tr><tr id="jcy05a_45"><td id="jcy05a_51"><p>Estudantes Universit&aacute;rios</p></td><td id="jcy05a_52"><p>Alunos de gradua&ccedil;&atilde;o e p&oacute;s-gradua&ccedil;&atilde;o que precisam gerenciar seu tempo de estudo e organizar seu material de aprendizado de forma eficiente.</p></td></tr><tr id="jcy05a_46"><td id="jcy05a_53"><p>Estudantes Aut&ocirc;nomos</p></td><td id="jcy05a_54"><p>Indiv&iacute;duos que estudam de forma independente, como preparat&oacute;rios para concursos ou cursos livres, e necessitam de estrat&eacute;gias de estudo eficazes.</p></td></tr></tbody></table></div><p id="jcy05a_41">Esse p&uacute;blico-alvo foi selecionado com base na necessidade de ferramentas que combinem eficientemente a gest&atilde;o do tempo de estudo (t&eacute;cnica Pomodoro) e a organiza&ccedil;&atilde;o de conte&uacute;do (flashcards), al&eacute;m da oportunidade de compartilhar e trocar conhecimento por meio do mercado interno de flashcards, atendendo &agrave;s demandas dos estudantes desde o ensino m&eacute;dio at&eacute; o n&iacute;vel universit&aacute;rio.</p></section><section class="chapter"><h4 id="an-lise-da-concorr-ncia" data-toc="an-lise-da-concorr-ncia">An&aacute;lise da Concorr&ecirc;ncia</h4><p id="jcy05a_55">Ao analisar o mercado, foram identificados alguns aplicativos e plataformas que oferecem funcionalidades semelhantes ao aplicativo proposto, embora de forma fragmentada. Alguns dos principais concorrentes s&atilde;o:</p><div class="table-wrapper"><table class="wide" id="jcy05a_56"><thead><tr class="ijRowHead" id="jcy05a_59"><th id="jcy05a_63"><p><span class="control" id="jcy05a_67">Concorrente</span></p></th><th id="jcy05a_64"><p><span class="control" id="jcy05a_68">Funcionalidades</span></p></th><th id="jcy05a_65"><p><span class="control" id="jcy05a_69">Pontos</span> <span class="control" id="jcy05a_70">Fortes</span></p></th><th id="jcy05a_66"><p><span class="control" id="jcy05a_71">Pontos</span> <span class="control" id="jcy05a_72">Fracos</span></p></th></tr></thead><tbody><tr id="jcy05a_60"><td id="jcy05a_73"><p><span class="control" id="jcy05a_77">Anki</span></p></td><td id="jcy05a_74"><p>- Cria&ccedil;&atilde;o e revis&atilde;o de flashcards </p><br><p> - Gerenciamento de deck de flashcards</p></td><td id="jcy05a_75"><p>- Ampla base de usu&aacute;rios </p><br><p> - Algoritmo de repeti&ccedil;&atilde;o espa&ccedil;ada eficiente</p></td><td id="jcy05a_76"><p>- N&atilde;o possui integra&ccedil;&atilde;o com a t&eacute;cnica Pomodoro </p><br><p> - Interface pouco intuitiva</p></td></tr><tr id="jcy05a_61"><td id="jcy05a_81"><p><span class="control" id="jcy05a_85">Forest</span></p></td><td id="jcy05a_82"><p>- T&eacute;cnica Pomodoro </p><br><p> - Gerenciamento de tempo de estudo</p></td><td id="jcy05a_83"><p>- Interface amig&aacute;vel </p><br><p> - Gamifica&ccedil;&atilde;o da t&eacute;cnica Pomodoro</p></td><td id="jcy05a_84"><p>- N&atilde;o possui funcionalidades de flashcards </p><br><p> - Apenas gerenciamento de tempo, sem organiza&ccedil;&atilde;o de conte&uacute;do</p></td></tr><tr id="jcy05a_62"><td id="jcy05a_89"><p><span class="control" id="jcy05a_93">Quizlet</span></p></td><td id="jcy05a_90"><p>- Cria&ccedil;&atilde;o e revis&atilde;o de flashcards </p><br><p> - Compartilhamento de flashcards</p></td><td id="jcy05a_91"><p>- Ampla biblioteca de flashcards compartilhados </p><br><p> - Ferramentas de aprendizado interativas</p></td><td id="jcy05a_92"><p>- N&atilde;o possui integra&ccedil;&atilde;o com a t&eacute;cnica Pomodoro </p><br><p> - Foco apenas na funcionalidade de flashcards, sem gerenciamento de tempo</p></td></tr></tbody></table></div><p id="jcy05a_57">Essa an&aacute;lise da concorr&ecirc;ncia permite identificar as principais lacunas no mercado, as quais o aplicativo proposto pode preencher ao combinar as funcionalidades de gerenciamento de tempo (Pomodoro) e organiza&ccedil;&atilde;o de conte&uacute;do (flashcards), al&eacute;m de oferecer um mercado interno de flashcards para a troca de conhecimento entre os usu&aacute;rios.</p></section><section class="chapter"><h4 id="tend-ncias" data-toc="tend-ncias">Tend&ecirc;ncias:</h4><ul class="list _bullet" id="jcy05a_97"><li class="list__item" id="jcy05a_103"><p><span class="control" id="jcy05a_106">Crescente demanda por ferramentas de gerenciamento de tempo e organiza&ccedil;&atilde;o de estudo</span>: Estudantes e profissionais do meio acad&ecirc;mico buscam cada vez mais solu&ccedil;&otilde;es integradas que os ajudem a gerenciar seu tempo de estudo e aprendizado de forma eficiente.</p></li><li class="list__item" id="jcy05a_104"><p><span class="control" id="jcy05a_107">Ado&ccedil;&atilde;o da t&eacute;cnica Pomodoro no ambiente acad&ecirc;mico</span>: A t&eacute;cnica Pomodoro vem ganhando popularidade entre estudantes e pesquisadores, que a utilizam para aumentar sua produtividade durante os momentos de estudo e trabalho.</p></li><li class="list__item" id="jcy05a_105"><p><span class="control" id="jcy05a_108">Necessidade de compartilhamento e colabora&ccedil;&atilde;o no aprendizado</span>: Existe uma demanda crescente por plataformas que permitam a troca de conhecimento e a colabora&ccedil;&atilde;o entre estudantes e profissionais do meio acad&ecirc;mico.</p></li></ul><p id="jcy05a_98">Usando alguns termos para pesquisa no Google Trends vemos que h&aacute; uma busca ativa sobre os termos chaves como: pomodoro, flashcards, etc</p><figure id="jcy05a_99"><img alt="grafico_trends.png" src="images/grafico_trends.png" title="grafico_trends.png" width="1196" height="731"></figure><p id="jcy05a_100"><span class="control" id="jcy05a_109">Gr&aacute;ficos por termos:</span></p><ul class="list _bullet" id="jcy05a_101"><li class="list__item" id="jcy05a_110"><p id="jcy05a_114">Pomodoro <figure id="jcy05a_115"><img alt="pomodoro.png" src="images/pomodoro.png" title="pomodoro.png" width="1182" height="552"></figure></p></li><li class="list__item" id="jcy05a_111"><p id="jcy05a_116">T&eacute;cnica Estudo <figure id="jcy05a_117"><img alt="tecnica_estudo.png" src="images/tecnica_estudo.png" title="tecnica_estudo.png" width="1182" height="552"></figure></p></li><li class="list__item" id="jcy05a_112"><p id="jcy05a_118">T&eacute;cnica Pomodoro <figure id="jcy05a_119"><img alt="tecnica_pomodoro.png" src="images/tecnica_pomodoro.png" title="tecnica_pomodoro.png" width="1182" height="552"></figure></p></li><li class="list__item" id="jcy05a_113"><p id="jcy05a_120">Flashcards <figure id="jcy05a_121"><img alt="flashcards.png" src="images/flashcards.png" title="flashcards.png" width="1182" height="526"></figure></p></li></ul></section></section><section class="chapter"><h3 id="oportunidades" data-toc="oportunidades">Oportunidades:</h3><ul class="list _bullet" id="jcy05a_122"><li class="list__item" id="jcy05a_124"><p><span class="control" id="jcy05a_127">Integra&ccedil;&atilde;o de ferramentas de gerenciamento de tempo e organiza&ccedil;&atilde;o de conte&uacute;do</span>: O mercado carece de solu&ccedil;&otilde;es que combinem de forma eficiente e fluida a t&eacute;cnica Pomodoro e a utiliza&ccedil;&atilde;o de flashcards, atendendo &agrave;s necessidades dos estudantes.</p></li><li class="list__item" id="jcy05a_125"><p><span class="control" id="jcy05a_128">Cria&ccedil;&atilde;o de um ecossistema de compartilhamento de conhecimento</span>: O desenvolvimento de um mercado interno de flashcards, onde os usu&aacute;rios possam comprar, vender e trocar materiais de estudo, representa uma oportunidade significativa para fomentar a colabora&ccedil;&atilde;o e a troca de conhecimento no meio acad&ecirc;mico.</p></li><li class="list__item" id="jcy05a_126"><p><span class="control" id="jcy05a_129">Diferencia&ccedil;&atilde;o por meio da integra&ccedil;&atilde;o de funcionalidades</span>: A maioria das solu&ccedil;&otilde;es atuais se concentra em apenas uma das necessidades (gerenciamento de tempo ou organiza&ccedil;&atilde;o de flashcards), deixando uma lacuna a ser preenchida por um aplicativo que integre essas funcionalidades de forma completa.</p></li></ul><p id="jcy05a_123">Essas tend&ecirc;ncias e oportunidades de mercado indicam que o aplicativo proposto pode preencher uma demanda relevante do p&uacute;blico-alvo, oferecendo uma solu&ccedil;&atilde;o integrada e inovadora para o gerenciamento do tempo de estudo e a organiza&ccedil;&atilde;o do conte&uacute;do de aprendizado, al&eacute;m de promover a colabora&ccedil;&atilde;o e a troca de conhecimento entre os usu&aacute;rios.</p></section><section class="chapter"><h3 id="posicionamento-e-diferencial-competitivo" data-toc="posicionamento-e-diferencial-competitivo">Posicionamento e Diferencial Competitivo</h3><p id="jcy05a_130">Com base na an&aacute;lise do mercado e das necessidades do p&uacute;blico-alvo, o aplicativo proposto se posicionar&aacute; como uma solu&ccedil;&atilde;o integrada e inovadora, com os seguintes diferenciais competitivos:</p><ol class="list _decimal" id="jcy05a_131" type="1"><li class="list__item" id="jcy05a_133"><p id="jcy05a_137"><span class="control" id="jcy05a_138">Combina&ccedil;&atilde;o de Pomodoro e Flashcards</span>: O aplicativo ser&aacute; a &uacute;nica solu&ccedil;&atilde;o do mercado que combina de forma fluida e eficiente a t&eacute;cnica Pomodoro para gerenciamento do tempo de estudo e as funcionalidades de cria&ccedil;&atilde;o, organiza&ccedil;&atilde;o e revis&atilde;o de flashcards. Essa integra&ccedil;&atilde;o permitir&aacute; que os usu&aacute;rios otimizem seu processo de aprendizado.</p></li><li class="list__item" id="jcy05a_134"><p id="jcy05a_139"><span class="control" id="jcy05a_140">Mercado Interno de Flashcards</span>: A implementa&ccedil;&atilde;o de um mercado interno, onde os usu&aacute;rios poder&atilde;o comprar, vender e trocar flashcards usando uma moeda pr&oacute;pria da plataforma, ser&aacute; um diferencial competitivo. Essa funcionalidade fomentar&aacute; a colabora&ccedil;&atilde;o e a troca de conhecimento entre os estudantes e profissionais do meio acad&ecirc;mico.</p></li><li class="list__item" id="jcy05a_135"><p id="jcy05a_141"><span class="control" id="jcy05a_142">Foco no P&uacute;blico Acad&ecirc;mico</span>: Ao concentrar-se especificamente nas necessidades dos estudantes do ensino m&eacute;dio, universit&aacute;rios e profissionais do meio acad&ecirc;mico, o aplicativo se diferenciar&aacute; de solu&ccedil;&otilde;es gen&eacute;ricas de gerenciamento de tempo e flashcards, oferecendo uma experi&ecirc;ncia personalizada e adaptada &agrave;s demandas desse p&uacute;blico-alvo.</p></li><li class="list__item" id="jcy05a_136"><p id="jcy05a_143"><span class="control" id="jcy05a_144">Interface Intuitiva e Acess&iacute;vel</span>: O aplicativo priorizar&aacute; o desenvolvimento de uma interface de usu&aacute;rio intuitiva, responsiva e acess&iacute;vel, facilitando a ado&ccedil;&atilde;o e a usabilidade por parte dos estudantes e profissionais do meio acad&ecirc;mico, independentemente de seu n&iacute;vel de familiaridade com esse tipo de ferramenta.</p></li></ol><p id="jcy05a_132">Esse posicionamento estrat&eacute;gico, aliado aos diferenciais competitivos do aplicativo, permitir&aacute; que o produto se destaque no mercado e se torne uma solu&ccedil;&atilde;o de refer&ecirc;ncia para o gerenciamento eficiente do tempo de estudo e a organiza&ccedil;&atilde;o do conte&uacute;do de aprendizado no meio acad&ecirc;mico.</p></section></section><div class="last-modified">Last modified: 09 dezembro 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="bdr.html" class="navigation-links__prev">BRD</a><a href="processo-de-desenvolvimento.html" class="navigation-links__next">Processo de Desenvolvimento</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.10.0-b518/app.js"></script></body></html>